NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_flpr.svd
            <register>
              <name>DIV</name>
              <description>MCK divider.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DIV</name>
                  <description>MCK frequency configuration</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>CKDIV2</name>
                      <description>CK divided by 2</description>
                      <value>0x80000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV3</name>
                      <description>CK divided by 3</description>
                      <value>0x50000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV4</name>
                      <description>CK divided by 4</description>
                      <value>0x40000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV5</name>
                      <description>CK divided by 5</description>
                      <value>0x30000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV6</name>
                      <description>CK divided by 6</description>
                      <value>0x28000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV8</name>
                      <description>CK divided by 8</description>
                      <value>0x20000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV10</name>
                      <description>CK divided by 10</description>
                      <value>0x18000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV11</name>
                      <description>CK divided by 11</description>
                      <value>0x16000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV15</name>
                      <description>CK divided by 15</description>
                      <value>0x11000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV16</name>
                      <description>CK divided by 16</description>
                      <value>0x10000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV21</name>
                      <description>CK divided by 21</description>
                      <value>0x0C000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV23</name>
                      <description>CK divided by 23</description>
                      <value>0x0B000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV30</name>
                      <description>CK divided by 30</description>
                      <value>0x08800000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV31</name>
                      <description>CK divided by 31</description>
                      <value>0x08400000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV32</name>
                      <description>CK divided by 32</description>
                      <value>0x08000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV42</name>
                      <description>CK divided by 42</description>
                      <value>0x06000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV63</name>
                      <description>CK divided by 63</description>
                      <value>0x04100000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV125</name>
                      <description>CK divided by 125</description>
                      <value>0x020C0000</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SRC</name>
              <description>MCK clock source selection</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CLKSRC</name>
                  <description>Clock source selection</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>PCLK</name>
                      <description>Peripheral clock (instantiation table shows the TDM PCLK frequency)</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PCLK32M</name>
                      <description>Deprecated enumerator -  Legacy enumerator provided for backward compatibility</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACLK</name>
                      <description>Audio PLL clock</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>BYPASS</name>
                  <description>Bypass clock generator. MCK will be equal to source input. If bypass is enabled the MCKFREQ setting has no effect.</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable bypass</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable bypass</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>SCK</name>
            <description>Unspecified</description>
            <headerStructName>TDM_CONFIG_SCK</headerStructName>
            <access>read-write</access>
            <addressOffset>0x014</addressOffset>
            <register>
              <name>DIV</name>
              <description>SCK divider.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SCKDIV</name>
                  <description>SCK frequency configuration</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>CKDIV2</name>
                      <description>CK divided by 2</description>
                      <value>0x80000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV3</name>
                      <description>CK divided by 3</description>
                      <value>0x50000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV4</name>
                      <description>CK divided by 4</description>
                      <value>0x40000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV5</name>
                      <description>CK divided by 5</description>
                      <value>0x30000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV6</name>
                      <description>CK divided by 6</description>
                      <value>0x28000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV8</name>
                      <description>CK divided by 8</description>
                      <value>0x20000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV10</name>
                      <description>CK divided by 10</description>
                      <value>0x18000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV11</name>
                      <description>CK divided by 11</description>
                      <value>0x16000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV15</name>
                      <description>CK divided by 15</description>
                      <value>0x11000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV16</name>
                      <description>CK divided by 16</description>
                      <value>0x10000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV21</name>
                      <description>CK divided by 21</description>
                      <value>0x0C000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV23</name>
                      <description>CK divided by 23</description>
                      <value>0x0B000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV30</name>
                      <description>CK divided by 30</description>
                      <value>0x08800000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV31</name>
                      <description>CK divided by 31</description>
                      <value>0x08400000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV32</name>
                      <description>CK divided by 32</description>
                      <value>0x08000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV42</name>
                      <description>CK divided by 42</description>
                      <value>0x06000000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV63</name>
                      <description>CK divided by 63</description>
                      <value>0x04100000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CKDIV125</name>
                      <description>CK divided by 125</description>
                      <value>0x020C0000</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SRC</name>
              <description>SCK clock source selection</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CLKSRC</name>
                  <description>Clock source selection</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>PCLK</name>
                      <description>Peripheral clock (instantiation table shows the TDM PCLK frequency)</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACLK</name>
                      <description>Audio PLL clock</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>BYPASS</name>
                  <description>Bypass clock generator. SCK will be equal to source input. If bypass is enabled the SCKFREQ setting has no effect.</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable bypass</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable bypass</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>POLARITY</name>
              <description>Set SCK Polarity.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SCKPOLARITY</name>
                  <description>Set the polarity of the active SCK edge.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>PosEdge</name>
                      <description>TX data is written to the SDOUT pin on the falling edge of SCK, ready to be
                    received on the rising edge of SCK.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NegEdge</name>
                      <description>TX data is written to the SDOUT pin on the rising edge of SCK, ready to be
                    received on the falling edge of SCK.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>SWIDTH</name>
            <description>Sample and word width configuration.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SWIDTH</name>
                <description>Sample and word width</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>8Bit</name>
                    <description>8 bit sample in an 8-bit word.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16Bit</name>
                    <description>16 bit sample in a 16-bit word.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>24Bit</name>
                    <description>24 bit sample in a 24-bit word.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32Bit</name>
                    <description>32 bit sample in a 32-bit word.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8BitIn16</name>
                    <description>8 bit sample in a 16-bit word.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8BitIn32</name>
                    <description>8 bit sample in a 32-bit word.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16BitIn32</name>
                    <description>16 bit sample in a 32-bit word.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>24BitIn32</name>
                    <description>24 bit sample in a 32-bit word.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ALIGN</name>
            <description>Alignment of sample within the audio data word.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ALIGN</name>
                <description>Alignment of sample within the audio data word.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Left</name>
                    <description>Left-aligned.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Right</name>
                    <description>Right-aligned.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
